name: "pth"
backend: "python"
max_batch_size: 64
input [
    {
      name: "input_ids"
      data_type: TYPE_INT32
      dims: [ -1, 128 ]
    },
    {
      name: "attention_mask"
      data_type: TYPE_INT32
      dims: [ -1, 128 ]
    }
]
output [
    {
      name: "output"
      data_type: TYPE_FP32
      dims: [ -1, 2 ]
    }
]
instance_group [{ kind: KIND_CPU }]
dynamic_batching {{
    max_queue_delay_microseconds: 1000
    preferred_batch_size: [16, 32, 64]
}}